{
  "extensionName": {
    "message": "Chromium Mask"
  },

  "extensionDescription": {
    "message": "Rende i browser Chromium (Opera, Brave, Edge, Vivaldi, Arc, ecc.) compatibili con i siti che altrimenti non funzionerebbero."
  },

  "supportMessage": {
    "message": "If this add-on has helped you, please consider $SUPPORT_LINK$ ☕",
    "placeholders": {
      "SUPPORT_LINK": {
        "content": "$1"
      }
    }
  },

  "breakageWarning": {
    "message": "Anche se Chromium Mask può aiutare se vedi un messaggio \"Browser non supportato\", potrebbe causare problemi inaspettati su alcuni siti."
  },

  "reportBrokenSite": {
    "message": "Se trovi un sito che funziona meglio con Chromium Mask abilitato, per favore segnalalo $WEBCOMPAT$. Grazie! &hearts;",
    "placeholders": {
      "WEBCOMPAT": {
        "content": "$1"
      }
    }
  },

  "inProductReporterLinkText": {
    "message": "tramite Help & Support del tuo browser"
  },

  "webcompatLinkText": {
    "message": "su WebCompat.com"
  },

  "maskStatusOn": {
    "message": "La maschera è attiva! Fingo di essere Chrome su questo sito."
  },

  "maskStatusOff": {
    "message": "La maschera è spenta. Appaio come il tuo browser su questo sito."
  },

  "maskStatusUnsupported": {
    "message": "La maschera non può funzionare su questo sito."
  },

  "mainToggleDescription": {
    "message": "Potrebbe essere necessario un aggiornamento forzato (Ctrl+F5) per cancellare la cache e applicare le modifiche."
  },

  "manageSitesButton": {
    "message": "Aggiungi o rimuovi siti"
  },

  "manageSitesFallback": {
    "message": "Per aggiungere o rimuovere siti, apri il Gestore Estensioni, seleziona Chromium Mask e clicca Impostazioni."
  },

  "addSiteTitle": {
    "message": "Aggiungi Sito"
  },

  "addSiteButton": {
    "message": "Aggiungi Sito"
  },

  "addSiteHostnameExplanation": {
    "message": "Nota: Inserisci il nome del dominio (es. example.com). L'estensione funzionerà su tutte le pagine e sottodomini di quel sito."
  },

  "addSiteErrorInvalid": {
    "message": "Per favore inserisci un dominio valido!"
  },

  "addSiteErrorAlreadyActive": {
    "message": "Chromium Mask è già abilitato per questo dominio!"
  },

  "maskedSitesTitle": {
    "message": "Siti Attualmente Mascherati"
  },

  "siteListRemoveButton": {
    "message": "Rimuovi"
  },

  "siteListEmpty": {
    "message": "Non hai ancora abilitato Chromium Mask su nessun sito!"
  },

  "linuxSpoofToggle": {
    "message": "Fingi di essere Windows invece di Linux"
  },

  "linuxSpoofToggleDescription": {
    "message": "Alcuni siti bloccano i browser Linux. Abilita questo per apparire come Windows Chrome invece di Linux Chrome."
  },

  "linuxPlatformTitle": {
    "message": "Impostazioni Piattaforma Linux"
  },
  "optionsLinuxSpoofTitle": {
    "message": "Spoofing Windows su Linux",
    "description": "Il sottotitolo H3 per la funzione di spoofing Windows su Linux."
  },
  "optionsLinuxSpoofDescription": {
    "message": "Per qualsiasi sito mascherato, puoi abilitare lo spoofing Windows per risolvere problemi specifici degli utenti Linux (ad esempio con servizi di streaming video).",
    "description": "Il paragrafo che spiega la funzione di spoofing Windows su Linux."
  },
  "addSiteErrorAlreadySpoofing": {
    "message": "Questo sito è già nella lista di spoofing Windows.",
    "description": "Errore quando si tenta di aggiungere un sito già presente nella lista di spoofing."
  },
  "optionsLinuxSpoofEmpty": {
    "message": "Nessun sito è configurato per lo spoofing Windows.",
    "description": "Messaggio mostrato quando la lista di spoofing Linux è vuota."
  },
  "optionsSpoofingAsWindows": {
    "message": "(Spoofing come Windows)",
    "description": "Testo piccolo accanto a un hostname che indica che viene effettuato lo spoofing come Windows."
  },
  "linuxSpoofOptionNote": {
    "message": "Questo influisce su tutti i siti dove è abilitata la mascheratura Chrome. Puoi cambiare questa impostazione in qualsiasi momento."
  },
  "managePlatformLinkText": {
    "message": "Gestisci le impostazioni della piattaforma per sito",
    "description": "Testo del link nel popup per aprire la pagina delle opzioni per le impostazioni specifiche di Linux."
  }
}
