{
  "extensionName": {
    "message": "Chromium Mask"
  },

  "extensionDescription": {
    "message": "Rend les navigateurs Chromium (Opera, Brave, Edge, Vivaldi, Arc, etc.) compatibles avec les sites qui autrement ne fonctionneraient pas."
  },

  "supportMessage": {
    "message": "If this add-on has helped you, please consider $SUPPORT_LINK$ ☕",
    "placeholders": {
      "SUPPORT_LINK": {
        "content": "$1"
      }
    }
  },

  "breakageWarning": {
    "message": "Bien que Chromium Mask puisse vous aider si vous voyez un message « votre navigateur n'est pas supporté », il peut causer des problèmes de façon inattendu sur certains sites."
  },

  "reportBrokenSite": {
    "message": "Si vous trouvez qu'un site fonctionne mieux avec Chromium Mask activé, s'il-vous-plaît veuillez le rapporter $WEBCOMPAT$. Merci! &hearts;",
    "placeholders": {
      "WEBCOMPAT": {
        "content": "$1"
      }
    }
  },

  "inProductReporterLinkText": {
    "message": "via l'aide et le support de votre navigateur"
  },

  "webcompatLinkText": {
    "message": "sur WebCompat.com"
  },

  "maskStatusOn": {
    "message": "Le masque est activé! Je prétends d'être Chrome pour ce site."
  },

  "maskStatusOff": {
    "message": "Le masque est désactivé. Je ressemble à votre navigateur pour ce site."
  },

  "maskStatusUnsupported": {
    "message": "Le masque ne peut pas fonctionner sur ce site."
  },

  "mainToggleDescription": {
    "message": "Un rafraîchissement complet (Ctrl+F5) peut être nécessaire pour vider le cache et appliquer les modifications."
  },

  "manageSitesButton": {
    "message": "Ajouter ou supprimer des sites"
  },

  "manageSitesFallback": {
    "message": "Pour ajouter ou supprimer des sites, veuillez ouvrir le gestionnaire d'extensions, sélectionner Chromium Mask et appuyer sur Préfèrences."
  },

  "addSiteTitle": {
    "message": "Ajouter un site"
  },

  "addSiteButton": {
    "message": "Ajouter un site"
  },

  "addSiteHostnameExplanation": {
    "message": "Note: Entrez toujours un nom de domaine complet. Si vous entrez example.com, Chromium Mask ne sera pas actif sur www.example.com"
  },

  "addSiteErrorInvalid": {
    "message": "Entrez un nom de domaine valide!"
  },

  "addSiteErrorAlreadyActive": {
    "message": "Chromium Mask est déjà activé sur ce site!"
  },

  "maskedSitesTitle": {
    "message": "Sites avec un masque actif"
  },

  "siteListRemoveButton": {
    "message": "Supprimer"
  },

  "siteListEmpty": {
    "message": "Vous n'avez pas encore activé Chromium Mask sur un site!"
  },

  "linuxSpoofToggle": {
    "message": "Se faire passer pour Windows au lieu de Linux"
  },

  "linuxSpoofToggleDescription": {
    "message": "Certains sites bloquent les navigateurs Linux. Activez ceci pour apparaître comme Chrome Windows au lieu de Chrome Linux."
  },

  "linuxPlatformTitle": {
    "message": "Paramètres de la plateforme Linux"
  },
  "optionsLinuxSpoofTitle": {
    "message": "Usurpation Windows sur Linux",
    "description": "Le sous-titre H3 pour la fonctionnalité d'usurpation Windows sur Linux."
  },
  "optionsLinuxSpoofDescription": {
    "message": "Pour tout site masqué, vous pouvez activer l'usurpation Windows pour résoudre des problèmes spécifiques aux utilisateurs Linux (ex : services de streaming vidéo).",
    "description": "Le paragraphe expliquant la fonctionnalité d'usurpation Windows sur Linux."
  },
  "addSiteErrorAlreadySpoofing": {
    "message": "Ce site est déjà dans la liste d'usurpation Windows.",
    "description": "Erreur lors de l'ajout d'un site déjà dans la liste d'usurpation."
  },
  "optionsLinuxSpoofEmpty": {
    "message": "Aucun site n'est configuré pour l'usurpation Windows.",
    "description": "Message affiché lorsque la liste d'usurpation Linux est vide."
  },
  "optionsSpoofingAsWindows": {
    "message": "(Usurpation Windows)",
    "description": "Petit texte à côté d'un nom d'hôte indiquant qu'il est usurpé en tant que Windows."
  },
  "linuxSpoofOptionNote": {
    "message": "Ceci affecte tous les sites où le masquage Chrome est activé. Vous pouvez modifier ce paramètre à tout moment."
  },
  "managePlatformLinkText": {
    "message": "Gérer les paramètres de plateforme par site",
    "description": "Texte du lien dans le popup pour ouvrir la page d'options des paramètres spécifiques à Linux."
  }
}
